# GetMaterialIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction..::..GetMaterialIds Method
EnergyAnalysisConstruction Class See Also
---
Returns a list of ids of the associated materials to analytical construction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<ElementId> GetMaterialIds()
```

Visual Basic
---
```text
Public Function GetMaterialIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMaterialIds()
```

# See Also
EnergyAnalysisConstruction Class
GetMaterialIds Overload
Autodesk.Revit.DB.Analysis Namespace